spec/fixtures/stripe_events/evt_charge_failed.json

{
	"id": "evt_160QNk4EwpIVSrdkwIz8Ht5q",
	"created": 1431148812,
	"livemode": false,
	"type": "charge.failed",
	"data": {
		"object": {
			"id": "ch_160QNk4EwpIVSrdkFc5DOYio",
			"object": "charge",
			"created": 1431148812,
			"livemode": false,
			"paid": false,
			"status": "failed",
			"amount": 999,
			"currency": "usd",
			"refunded": false,
			"source": {
				"id": "card_160QNj4EwpIVSrdkSrjvFlOR",
				"object": "card",
				"last4": "0002",
				"brand": "Visa",
				"funding": "credit",
				"exp_month": 10,
				"exp_year": 2015,
				"fingerprint": "lM1mRgDoDWwh1wP6",
				"country": "US",
				"name": null,
				"address_line1": null,
				"address_line2": null,
				"address_city": null,
				"address_state": null,
				"address_zip": null,
				"address_country": null,
				"cvc_check": "pass",
				"address_line1_check": null,
				"address_zip_check": null,
				"dynamic_last4": null,
				"metadata": {},
				"customer": "cus_6AigMqcxfS02rf"
			},
			"captured": false,
			"card": {
				"id": "card_160QNj4EwpIVSrdkSrjvFlOR",
				"object": "card",
				"last4": "0002",
				"brand": "Visa",
				"funding": "credit",
				"exp_month": 10,
				"exp_year": 2015,
				"fingerprint": "lM1mRgDoDWwh1wP6",
				"country": "US",
				"name": null,
				"address_line1": null,
				"address_line2": null,
				"address_city": null,
				"address_state": null,
				"address_zip": null,
				"address_country": null,
				"cvc_check": "pass",
				"address_line1_check": null,
				"address_zip_check": null,
				"dynamic_last4": null,
				"metadata": {},
				"customer": "cus_6AigMqcxfS02rf"
			},
			"balance_transaction": null,
			"failure_message": "Your card was declined.",
			"failure_code": "card_declined",
			"amount_refunded": 0,
			"customer": "cus_6AigMqcxfS02rf",
			"invoice": null,
			"description": null,
			"dispute": null,
			"metadata": {},
			"statement_descriptor": "Paid users",
			"fraud_details": {},
			"receipt_email": null,
			"receipt_number": null,
			"shipping": null,
			"application_fee": null,
			"refunds": {
				"object": "list",
				"total_count": 0,
				"has_more": false,
				"url": "/v1/charges/ch_160QNk4EwpIVSrdkFc5DOYio/refunds",
				"data": [

				]
			},
			"statement_description": "Paid users"
		}
	},
	"object": "event",
	"pending_webhooks": 1,
	"request": "iar_6Cq3YUpAu32an6",
	"api_version": "2014-06-17"
}
