spec/fixtures/stripe_events/evt_charge_succeeded.json

{
  "id": "evt_15yNEr4EwpIVSrdkwSGYWCvC",
  "created": 1430660073,
  "livemode": false,
  "type": "charge.succeeded",
  "data": {
    "object": {
      "id": "ch_15yNEr4EwpIVSrdkZpckuwAJ",
      "object": "charge",
      "created": 1430660073,
      "livemode": false,
      "paid": true,
      "status": "paid",
      "amount": 999,
      "currency": "usd",
      "refunded": false,
      "source": {
        "id": "card_15yNEq4EwpIVSrdk3mw7noBZ",
        "object": "card",
        "last4": "4242",
        "brand": "Visa",
        "funding": "credit",
        "exp_month": 3,
        "exp_year": 2016,
        "fingerprint": "JOaMCD3EefOMboZC",
        "country": "US",
        "name": null,
        "address_line1": null,
        "address_line2": null,
        "address_city": null,
        "address_state": null,
        "address_zip": null,
        "address_country": null,
        "cvc_check": "pass",
        "address_line1_check": null,
        "address_zip_check": null,
        "dynamic_last4": null,
        "metadata": {},
        "customer": "cus_6AigMqcxfS02rf"
      },
      "captured": true,
      "card": {
        "id": "card_15yNEq4EwpIVSrdk3mw7noBZ",
        "object": "card",
        "last4": "4242",
        "brand": "Visa",
        "funding": "credit",
        "exp_month": 3,
        "exp_year": 2016,
        "fingerprint": "JOaMCD3EefOMboZC",
        "country": "US",
        "name": null,
        "address_line1": null,
        "address_line2": null,
        "address_city": null,
        "address_state": null,
        "address_zip": null,
        "address_country": null,
        "cvc_check": "pass",
        "address_line1_check": null,
        "address_zip_check": null,
        "dynamic_last4": null,
        "metadata": {},
        "customer": "cus_6AigMqcxfS02rf"
      },
      "balance_transaction": "txn_15yNEr4EwpIVSrdkRzgAd5h7",
      "failure_message": null,
      "failure_code": null,
      "amount_refunded": 0,
      "customer": "cus_6AigMqcxfS02rf",
      "invoice": "in_15yNEq4EwpIVSrdk8JnYukf0",
      "description": null,
      "dispute": null,
      "metadata": {},
      "statement_descriptor": "Paid users",
      "fraud_details": {},
      "receipt_email": null,
      "receipt_number": null,
      "shipping": null,
      "application_fee": null,
      "refunds": {
        "object": "list",
        "total_count": 0,
        "has_more": false,
        "url": "/v1/charges/ch_15yNEr4EwpIVSrdkZpckuwAJ/refunds",
        "data": []
      },
      "statement_description": "Paid users"
    }
  },
  "object": "event",
  "pending_webhooks": 1,
  "request": "iar_6AigfMyFINVEx5",
  "api_version": "2014-06-17"
}
